In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# Pandas Foundations

DataFrame is just like a spreadsheet, and Series is the single columns of data inside the DataFrame, each column(Series) holds precisely one data type. 

Both DataFrame and Series has Index component, one key reason that makes them so special and handy to use.

DataFrame and Series consist of three components Index,columns and data(values).

When you need to select one specific data element or subset of data, use index label and column name to find the target.

The first step (suppose we already have csv,excel or sql files at hand, which in reality, is seldom the case) is to read the data into the dataframe.
We have a very powerful and versatile function read_csv (read the official document for more details,mutiple parameters making this function very flexible).

In [6]:
data=pd.read_csv('BikeRiding2012.csv',index_col='Date',parse_dates=['Date'],dayfirst=True)

In [7]:
data.head()  # read the first few rows,to get a feel of the data.

,Unnamed: 1,Rachel / Papineau,Berri1,Maisonneuve_2,Maisonneuve_1,Brébeuf,Parc,PierDup,CSC (Côte Sainte-Catherine),Pont_Jacques_Cartier
Date,,,,,,,,,,
2012-01-01,00:00,16,35,51,38,5.0,26,10,0,27.0
2012-01-02,00:00,43,83,153,68,11.0,53,6,1,21.0
2012-01-03,00:00,58,135,248,104,2.0,89,3,2,15.0
2012-01-04,00:00,61,144,318,116,2.0,111,8,1,19.0
2012-01-05,00:00,95,197,330,124,6.0,97,13,2,16.0

In [8]:
data.index #in this exmple, the idexes are dates.

DatetimeIndex(['2012-01-01', '2012-01-02', '2012-01-03', '2012-01-04',
               '2012-01-05', '2012-01-06', '2012-01-07', '2012-01-08',
               '2012-01-09', '2012-01-10',
               ...
               '2012-12-22', '2012-12-23', '2012-12-24', '2012-12-25',
               '2012-12-26', '2012-12-27', '2012-12-28', '2012-12-29',
               '2012-12-30', '2012-12-31'],
              dtype='datetime64[ns]', name='Date', length=366, freq=None)

In [9]:
data.columns

Index(['Unnamed: 1', 'Rachel / Papineau', 'Berri1', 'Maisonneuve_2',
       'Maisonneuve_1', 'Brébeuf', 'Parc', 'PierDup',
       'CSC (Côte Sainte-Catherine)', 'Pont_Jacques_Cartier'],
      dtype='object')

In [12]:
data.values  # numpy arrays

array([['00:00', 16, 35, ..., 10, 0, 27.0],
       ['00:00', 43, 83, ..., 6, 1, 21.0],
       ['00:00', 58, 135, ..., 3, 2, 15.0],
       ...,
       ['00:00', 0, 27, ..., 0, 0, nan],
       ['00:00', 0, 5, ..., 0, 0, nan],
       ['00:00', 0, 4, ..., 0, 0, nan]], dtype=object)

Data can be continuous ( height, weight....) and categorical( gender, color....)
pandas sponsor Boolean,Integer,Float,Complex,Object,Datetime,Timedelta,Categorical.
(the object data type is a catch-all)

In [14]:
data.dtypes

Unnamed: 1                      object
Rachel / Papineau                int64
Berri1                           int64
Maisonneuve_2                    int64
Maisonneuve_1                    int64
Brébeuf                        float64
Parc                             int64
PierDup                          int64
CSC (Côte Sainte-Catherine)      int64
Pont_Jacques_Cartier           float64
dtype: object

In [15]:
data.get_dtype_counts()

float64    2
int64      7
object     1
dtype: int64

A Series a single column of DataFrame. A series is composed of an index and the values.
One common operation is to select one column(Series) from the dataframe, to do this, pass  the string to the indexing operator of the dataframe.

In [16]:
ParcData=data['Parc']  # return a series. alternative: ParcData=data.Parc

In [17]:
ParcData.head()    #

Date
2012-01-01     26
2012-01-02     53
2012-01-03     89
2012-01-04    111
2012-01-05     97
Name: Parc, dtype: int64

In [18]:
type(ParcData)

pandas.core.series.Series

Note: the dot notation(ParcData=data.Parc) is not recommended to use in production, which is prone to error. (what if the column name is 'zip code')

in case you want to convert a Series to data frame use to_frame() function.

Series has many powerful functions and share a lot in common with DataFrames.

In [21]:
objSeries=data['Unnamed: 1']   # to emphasize the diff, this is not a good name btw.
intSeries=data['Berri1']

In [22]:
objSeries.value_counts() #this column only has one value...

00:00    366
Name: Unnamed: 1, dtype: int64

In [25]:
intSeries.describe()

count     366.000000
mean     2678.234973
std      2149.301945
min         4.000000
25%       433.500000
50%      2326.000000
75%      4642.750000
max      7104.000000
Name: Berri1, dtype: float64

For object data types, the most commonly used function is value_counts()
For numerical data types, a good choice might be describe(), or you can use min(),max(),mean(),median(),std(),quantile() and sum() to do some basic statistic calculations.

In [26]:
objSeries.count()

366

In [28]:
objSeries.size

366

Note, to count the number of elements of the Series, you can use size and shape parameter or the len func. but as you can see there is also a count() func, this one is counting all the non-missing values.

In [31]:
intSeries.isnull()

Date
2012-01-01    False
2012-01-02    False
2012-01-03    False
2012-01-04    False
2012-01-05    False
2012-01-06    False
2012-01-07    False
2012-01-08    False
2012-01-09    False
2012-01-10    False
2012-01-11    False
2012-01-12    False
2012-01-13    False
2012-01-14    False
2012-01-15    False
2012-01-16    False
2012-01-17    False
2012-01-18    False
2012-01-19    False
2012-01-20    False
2012-01-21    False
2012-01-22    False
2012-01-23    False
2012-01-24    False
2012-01-25    False
2012-01-26    False
2012-01-27    False
2012-01-28    False
2012-01-29    False
2012-01-30    False
              ...
2012-12-02    False
2012-12-03    False
2012-12-04    False
2012-12-05    False
2012-12-06    False
2012-12-07    False
2012-12-08    False
2012-12-09    False
2012-12-10    False
2012-12-11    False
2012-12-12    False
2012-12-13    False
2012-12-14    False
2012-12-15    False
2012-12-16    False
2012-12-17    False
2012-12-18    False
2012-12-19    False
2012-12-20    False
2012-12-21    False
2012-12-22    False
2012-12-23    False
2012-12-24    False
2012-12-25    False
2012-12-26    False
2012-12-27    False
2012-12-28    False
2012-12-29    False
2012-12-30    False
2012-12-31    False
Name: Berri1, Length: 366, dtype: bool

In [32]:
intSeries.isnull().sum() # get the number of null values in the series, in this case, no null values.

0

In [33]:
intSeries.notnull().sum()

366

In the upper example, intSeries.notnull().sum() ,we actually used what is called Method chaining, because as the first func returns a new series, we can call another func on this new series, and it goes on and on, but sometimes this should be avoided to better readability.

Next, we will do manipulation with DataFrames, as you will see, it share a lot funcs with Series.

In [39]:
example=pd.DataFrame({'Id':[1001,1002,1003,1004,1005,1006],
                    'Name':['Chris','Laura','Jack','Ellen','John','Max'],
                     'Age':[12,34,22,np.nan,23,20],
                     'Gender':['M','F','M','F','M','M'],
                     'GPA':[3.0,3.3,2.9,3.5,3.1,3.8]})
# here we manually built a dataframe to better explain the concepts.

In [41]:
example

    Age  GPA Gender    Id   Name
0  12.0  3.0      M  1001  Chris
1  34.0  3.3      F  1002  Laura
2  22.0  2.9      M  1003   Jack
3   NaN  3.5      F  1004  Ellen
4  23.0  3.1      M  1005   John
5  20.0  3.8      M  1006    Max

In [42]:
example.set_index('Id',inplace=True)

In [43]:
example.head()

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John

In [44]:
example.isnull().sum().sum() # check if there is null value in this df, there is a null value

1

In [46]:
example['Age'].isnull().sum()

1

In [48]:
example['Age'].fillna(example['Age'].mean()).astype(int)  # if you want it inplace add inplace=True in the fillna() func

Id
1001    12
1002    34
1003    22
1004    22
1005    23
1006    20
Name: Age, dtype: int32

Sometimes, the default index (0,1,2...n-1) is not very meaningful, if the data already contain column that acts as the identifier, we can set this column as the index use the set_index() func.

In [50]:
columns_rename={'Id':'Student_id','Name':'Student_name','Age':'Student_age'}
example=example.rename(columns=columns_rename)

In [51]:
example

      Student_age  GPA Gender Student_name
Id
1001         12.0  3.0      M        Chris
1002         34.0  3.3      F        Laura
1003         22.0  2.9      M         Jack
1004          NaN  3.5      F        Ellen
1005         23.0  3.1      M         John
1006         20.0  3.8      M          Max

In [52]:
example.columns

Index(['Student_age', 'GPA', 'Gender', 'Student_name'], dtype='object')

In [53]:
example.columns=['Age','GPA','Gender','Name'] # another way to set column names

In [54]:
example

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John
1006  20.0  3.8      M    Max

In many cases, you might need to add new columns or delete columns

In [55]:
example['Department']='NotKnown'

In [56]:
example

       Age  GPA Gender   Name Department
Id
1001  12.0  3.0      M  Chris   NotKnown
1002  34.0  3.3      F  Laura   NotKnown
1003  22.0  2.9      M   Jack   NotKnown
1004   NaN  3.5      F  Ellen   NotKnown
1005  23.0  3.1      M   John   NotKnown
1006  20.0  3.8      M    Max   NotKnown

In [57]:
del example['Department']

In [58]:
example

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John
1006  20.0  3.8      M    Max

In [59]:
example['Adult']=example['Age']>=18

In [60]:
example

       Age  GPA Gender   Name  Adult
Id
1001  12.0  3.0      M  Chris  False
1002  34.0  3.3      F  Laura   True
1003  22.0  2.9      M   Jack   True
1004   NaN  3.5      F  Ellen  False
1005  23.0  3.1      M   John   True
1006  20.0  3.8      M    Max   True

In [62]:
example['Adult'].all()  # check if all true

False

In [63]:
example=example.drop('Adult',axis=1) # another way to delete a column default: drop rows

In [64]:
example

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John
1006  20.0  3.8      M    Max

Note: Dataframe has two axis, axis=0 which is the default and axis=1. to memorize this, we can say when axis=0 we are getting or losing a row.  when axis=1, we are getting or losing a column, I find this the best way to memorize this.

In the previous example, we are always working on a single column. what if we want to work on multiple columns, simply pass a list of target column names to the indexing operator, so if you pass a string, you will get a Series, if you pass a list, you will get a new dataframe.

In [66]:
Student_Age_Name=example[['Name','Age']]

In [67]:
Student_Age_Name

       Name   Age
Id
1001  Chris  12.0
1002  Laura  34.0
1003   Jack  22.0
1004  Ellen   NaN
1005   John  23.0
1006    Max  20.0

another way to get columns is using method, such as filter
df.filter(like='targetInfo')

In [72]:
example.Gender.nunique()

2

selecting subsets of data

df.iloc[rows,columns]
df.loc[rows,columns]
here, rows and columns can be scalar values, lists,slice objects or boolean sequences.

In [84]:
example.loc[: ,['Name','Age']]

       Name   Age
Id
1001  Chris  12.0
1002  Laura  34.0
1003   Jack  22.0
1004  Ellen   NaN
1005   John  23.0
1006    Max  20.0

In [85]:
example.loc['1001':'1004','Age':'Gender']

       Age  GPA Gender
Id
1001  12.0  3.0      M
1002  34.0  3.3      F
1003  22.0  2.9      M
1004   NaN  3.5      F

another way is using boolean filter or boolean indexing

In [88]:
AdultOrNot=example['Age']>=18

In [89]:
AdultOrNot

Id
1001    False
1002     True
1003     True
1004    False
1005     True
1006     True
Name: Age, dtype: bool

In [90]:
AdultOrNot.sum()

4

In [91]:
AdultOrNot.mean() # about 67% of students are adults.

0.66666666666666663

In [95]:
criteria1=example.Gender=='F'
criteria2=example.Age>=18
criteria3=example.GPA>3.0

criterias=criteria1&criteria2&criteria3
criterias

Id
1001    False
1002     True
1003    False
1004    False
1005     True
1006     True
dtype: bool

In [96]:
example[criterias]

       Age  GPA Gender   Name
Id
1002  34.0  3.3      F  Laura
1005  23.0  3.1      F   John
1006  20.0  3.8      F    Max

Note: the comparison operators have a higher precedence than and ,or and not.
the bitwise operators &|and ~ have higher precedence than comparison operators.
the best practice as to add parentheses.

in the upper example, we use & instead of keyword and. because, and ,or and not keywords evaluate the truthiness of the objects as whole. it make no sense to check if a whole series is truth not so we use & .

next, we will talk more about index

In [97]:
columns=example.columns

In [98]:
columns

Index(['Age', 'GPA', 'Gender', 'Name'], dtype='object')

In [99]:
columns.values

array(['Age', 'GPA', 'Gender', 'Name'], dtype=object)

In [100]:
columns[2]

'Gender'

In [101]:
columns.min()

'Age'

index object works kind of like Series and dataframes and ndarrays. one of the biggest difference is that index is immutable.

In [122]:
s1=pd.Series([1,2,3,4],index=list('abcd'))

In [123]:
s2=pd.Series([0,2,0,4],index=list('abcd'))

In [124]:
s1+s2

a    1
b    4
c    3
d    8
dtype: int64

in the upper example, Series s1 ans s2 share the same index.
if the index are not the same, Cartesian product will be executed, see the example below.

In [127]:
s1=pd.Series([1,2,3,4],index=list('aaad'))
s2=pd.Series([0,2,0,4,7],index=list('aadef'))
s1+s2

a    1.0
a    3.0
a    2.0
a    4.0
a    3.0
a    5.0
d    4.0
e    NaN
f    NaN
dtype: float64

In [ ]:
to be added

Grouping for Aggregation,filtration and transformation
Aggregation means collapsing a whole lot of numbers into one number.
we will explain with an example

In [97]:
App_data=pd.read_csv('Appdata2017.csv',header=None, encoding='ISO-8859-1',na_values=[r'\N'])

In [98]:
App_data.head()

,0,1,2,3,4,5
0,ACMI.GameMasters,Game,1000,3.4,Free,Australian Centre for the Moving Image
1,ACinc.ascensionG.T,Game,1000,3.6,Free,Overflow
2,AControl.Main,Entertainment,5000,2.9,Free,Claray
3,ADW.Alien.Abstract,Personalization,100,4.5,CN£¤5.50 Buy,Alessandro Vuono
4,ADW.Black.Carbon,Personalization,100,4.5,CN£¤5.50 Buy,Alessandro Vuono

In [99]:
App_data.columns=['PkgName','Category','Downloads','Rating','Price','Developer']
App_data.set_index('PkgName',inplace=True)
App_data.head()

,Category,Downloads,Rating,Price,Developer
PkgName,,,,,
ACMI.GameMasters,Game,1000,3.4,Free,Australian Centre for the Moving Image
ACinc.ascensionG.T,Game,1000,3.6,Free,Overflow
AControl.Main,Entertainment,5000,2.9,Free,Claray
ADW.Alien.Abstract,Personalization,100,4.5,CN£¤5.50 Buy,Alessandro Vuono
ADW.Black.Carbon,Personalization,100,4.5,CN£¤5.50 Buy,Alessandro Vuono

In [100]:
App_data.info()  # Rating column's data type should be float, but it shows object,where we should pay attention

<class 'pandas.core.frame.DataFrame'>
Index: 200 entries, ACMI.GameMasters to BTS15.S
Data columns (total 5 columns):
Category     200 non-null object
Downloads    200 non-null int64
Rating       156 non-null float64
Price        200 non-null object
Developer    199 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 9.4+ KB

now suppose we want to calculate the average downloads for each category
actually, we can do this in multiple ways

In [101]:
App_data.groupby('Category').mean()

                             Downloads    Rating
Category
Books & Reference         25252.500000  3.725000
Business                   5250.000000  3.650000
Casual                     6978.812500  3.428571
Comics                      500.000000  4.800000
Communication               100.000000  3.500000
Education                144812.500000  4.037500
Entertainment             67720.000000  3.570000
Finance                   13220.000000  3.760000
Game                       7611.333333  3.700000
Health & Fitness          25191.666667  4.133333
Libraries & Demo            100.000000  4.200000
Lifestyle                  1828.571429  3.883333
Maps & Navigation          5262.500000  3.875000
Medical                     683.333333  3.066667
Music & Audio             10000.000000  3.700000
News & Magazines         100000.000000  3.400000
Personalization            2232.781818  4.496774
Photography                  25.857143  3.825000
Productivity             122722.222222  4.000000
Shopping                    300.000000  4.000000
Social                    10000.000000  4.400000
Tools                     61257.380952  3.850000
Travel & Local             2750.250000  3.666667
Video Players & Editors     100.000000  2.500000

In [102]:
App_data.groupby('Category')['Downloads'].mean()

Category
Books & Reference           25252.500000
Business                     5250.000000
Casual                       6978.812500
Comics                        500.000000
Communication                 100.000000
Education                  144812.500000
Entertainment               67720.000000
Finance                     13220.000000
Game                         7611.333333
Health & Fitness            25191.666667
Libraries & Demo              100.000000
Lifestyle                    1828.571429
Maps & Navigation            5262.500000
Medical                       683.333333
Music & Audio               10000.000000
News & Magazines           100000.000000
Personalization              2232.781818
Photography                    25.857143
Productivity               122722.222222
Shopping                      300.000000
Social                      10000.000000
Tools                       61257.380952
Travel & Local               2750.250000
Video Players & Editors       100.000000
Name: Downloads, dtype: float64

In [103]:
App_data.groupby('Category')['Downloads'].agg('mean')

Category
Books & Reference           25252.500000
Business                     5250.000000
Casual                       6978.812500
Comics                        500.000000
Communication                 100.000000
Education                  144812.500000
Entertainment               67720.000000
Finance                     13220.000000
Game                         7611.333333
Health & Fitness            25191.666667
Libraries & Demo              100.000000
Lifestyle                    1828.571429
Maps & Navigation            5262.500000
Medical                       683.333333
Music & Audio               10000.000000
News & Magazines           100000.000000
Personalization              2232.781818
Photography                    25.857143
Productivity               122722.222222
Shopping                      300.000000
Social                      10000.000000
Tools                       61257.380952
Travel & Local               2750.250000
Video Players & Editors       100.000000
Name: Downloads, dtype: float64

In [104]:
App_data.groupby('Category').agg({'Downloads':'mean'})

                             Downloads
Category
Books & Reference         25252.500000
Business                   5250.000000
Casual                     6978.812500
Comics                      500.000000
Communication               100.000000
Education                144812.500000
Entertainment             67720.000000
Finance                   13220.000000
Game                       7611.333333
Health & Fitness          25191.666667
Libraries & Demo            100.000000
Lifestyle                  1828.571429
Maps & Navigation          5262.500000
Medical                     683.333333
Music & Audio             10000.000000
News & Magazines         100000.000000
Personalization            2232.781818
Photography                  25.857143
Productivity             122722.222222
Shopping                    300.000000
Social                    10000.000000
Tools                     61257.380952
Travel & Local             2750.250000
Video Players & Editors     100.000000

In [105]:
type(App_data.groupby('Category'))

pandas.core.groupby.DataFrameGroupBy

this 'pandas.core.groupby.DataFrameGroupBy' is an intermediate object,it has an agg() func to perform aggregations.

now lets's modify the 'Price' column and make it into to two categories 'Free' and 'Paid'

In [106]:
App_data['Price'].value_counts()

Free             112
CN£¤7.78 Buy      34
CN£¤3.93 Buy       9
CN£¤5.50 Buy       8
CN£¤5.88 Buy       8
CN£¤7.71 Buy       7
CN£¤6.51 Buy       5
CN£¤4.39 Buy       2
CN£¤6.58 Buy       1
CN£¤4.54 Buy       1
CN£¤22.49 Buy      1
CN£¤8.81 Buy       1
CN£¤23.37 Buy      1
CN£¤7.57 Buy       1
CN£¤20.23 Buy      1
CN£¤13.14 Buy      1
CN£¤71.16 Buy      1
CN£¤5.45 Buy       1
CN£¤5.02 Buy       1
CN£¤32.81 Buy      1
CN£¤5.29 Buy       1
CN£¤23.50 Buy      1
CN£¤38.94 Buy      1
Name: Price, dtype: int64

In [107]:
def alter_Price(price):
    if price.startswith('CN'):
        price='Paid' 
        return price
    else:
        return price

In [108]:
App_data['Price']=App_data['Price'].apply(alter_Price)

In [109]:
App_data.head()

,Category,Downloads,Rating,Price,Developer
PkgName,,,,,
ACMI.GameMasters,Game,1000,3.4,Free,Australian Centre for the Moving Image
ACinc.ascensionG.T,Game,1000,3.6,Free,Overflow
AControl.Main,Entertainment,5000,2.9,Free,Claray
ADW.Alien.Abstract,Personalization,100,4.5,Paid,Alessandro Vuono
ADW.Black.Carbon,Personalization,100,4.5,Paid,Alessandro Vuono

In [112]:
App_data.Price.value_counts(normalize=True)

Free    0.56
Paid    0.44
Name: Price, dtype: float64

now, we want to know the average downloads for different categories and different prices.

In [114]:
App_data.groupby(['Category','Price']).agg({'Downloads':'mean'})

                                   Downloads
Category                Price
Books & Reference       Free    33666.666667
                        Paid       10.000000
Business                Free     5250.000000
Casual                  Free    18600.000000
                        Paid        6.100000
Comics                  Free      500.000000
Communication           Paid      100.000000
Education               Free   144812.500000
Entertainment           Free    67720.000000
Finance                 Free    16500.000000
                        Paid      100.000000
Game                    Free    10963.888889
                        Paid      906.222222
Health & Fitness        Free    37637.500000
                        Paid      300.000000
Libraries & Demo        Free      100.000000
Lifestyle               Free     2116.666667
                        Paid      100.000000
Maps & Navigation       Free     5262.500000
Medical                 Free     1000.000000
                        Paid       50.000000
Music & Audio           Free    10000.000000
News & Magazines        Free   100000.000000
Personalization         Free    30000.000000
                        Paid       54.960784
Photography             Paid       25.857143
Productivity            Free   150571.428571
                        Paid    25250.000000
Shopping                Free      300.000000
Social                  Free    10000.000000
Tools                   Free    67702.631579
                        Paid       27.500000
Travel & Local          Free     2750.250000
Video Players & Editors Free      100.000000

and now we want more information

In [115]:
App_data.groupby(['Category','Price'])['Downloads','Rating'].agg(['max','mean'])

                              Downloads                Rating
                                    max           mean    max      mean
Category                Price
Books & Reference       Free      50000   33666.666667    4.3  3.800000
                        Paid         10      10.000000    3.5  3.500000
Business                Free      10000    5250.000000    4.3  3.650000
Casual                  Free      50000   18600.000000    5.0  3.833333
                        Paid         50       6.100000    1.0  1.000000
Comics                  Free        500     500.000000    4.8  4.800000
Communication           Paid        100     100.000000    3.5  3.500000
Education               Free    1000000  144812.500000    5.0  4.037500
Entertainment           Free     500000   67720.000000    5.0  3.570000
Finance                 Free      50000   16500.000000    4.8  3.450000
                        Paid        100     100.000000    5.0  5.000000
Game                    Free     100000   10963.888889    5.0  3.694444
                        Paid       5000     906.222222    5.0  3.714286
Health & Fitness        Free     100000   37637.500000    5.0  4.225000
                        Paid        500     300.000000    4.4  3.950000
Libraries & Demo        Free        100     100.000000    4.2  4.200000
Lifestyle               Free      10000    2116.666667    5.0  4.220000
                        Paid        100     100.000000    2.2  2.200000
Maps & Navigation       Free      10000    5262.500000    5.0  3.875000
Medical                 Free       1000    1000.000000    4.1  4.100000
                        Paid         50      50.000000    1.0  1.000000
Music & Audio           Free      10000   10000.000000    4.0  3.700000
News & Magazines        Free     100000  100000.000000    3.4  3.400000
Personalization         Free      50000   30000.000000    4.4  4.125000
                        Paid        500      54.960784    5.0  4.551852
Photography             Paid        100      25.857143    5.0  3.825000
Productivity            Free    1000000  150571.428571    4.2  3.957143
                        Paid      50000   25250.000000    4.2  4.150000
Shopping                Free        500     300.000000    4.0  4.000000
Social                  Free      10000   10000.000000    4.4  4.400000
Tools                   Free     500000   67702.631579    5.0  3.850000
                        Paid         50      27.500000    NaN       NaN
Travel & Local          Free       5000    2750.250000    4.2  3.666667
Video Players & Editors Free        100     100.000000    2.5  2.500000

when things get complicated, the better way is to build a mapping dictionary and pass it to the agg() func.
data.groupby(['col1','col2']).agg({'col3':['mean','max'],
                                   'col4':['mean','min']})

In [117]:
App_metadata_info=App_data.groupby(['Category','Price']).agg({'Downloads':['mean','max'],
                                           'Rating':['mean','max']})

In [118]:
App_metadata_info.head(10)

                             Downloads             Rating
                                  mean      max      mean  max
Category          Price
Books & Reference Free    33666.666667    50000  3.800000  4.3
                  Paid       10.000000       10  3.500000  3.5
Business          Free     5250.000000    10000  3.650000  4.3
Casual            Free    18600.000000    50000  3.833333  5.0
                  Paid        6.100000       50  1.000000  1.0
Comics            Free      500.000000      500  4.800000  4.8
Communication     Paid      100.000000      100  3.500000  3.5
Education         Free   144812.500000  1000000  4.037500  5.0
Entertainment     Free    67720.000000   500000  3.570000  5.0
Finance           Free    16500.000000    50000  3.450000  4.8

In [120]:
col_level1=App_metadata_info.columns.get_level_values(0)
col_level1

Index(['Downloads', 'Downloads', 'Rating', 'Rating'], dtype='object')

In [121]:
col_level2=App_metadata_info.columns.get_level_values(1)
col_level2

Index(['mean', 'max', 'mean', 'max'], dtype='object')

In [123]:
App_metadata_info.columns=col_level1+'_'+col_level2
App_metadata_info.head(10)

                         Downloads_mean  Downloads_max  Rating_mean  \
Category          Price
Books & Reference Free     33666.666667          50000     3.800000
                  Paid        10.000000             10     3.500000
Business          Free      5250.000000          10000     3.650000
Casual            Free     18600.000000          50000     3.833333
                  Paid         6.100000             50     1.000000
Comics            Free       500.000000            500     4.800000
Communication     Paid       100.000000            100     3.500000
Education         Free    144812.500000        1000000     4.037500
Entertainment     Free     67720.000000         500000     3.570000
Finance           Free     16500.000000          50000     3.450000

                         Rating_max
Category          Price
Books & Reference Free          4.3
                  Paid          3.5
Business          Free          4.3
Casual            Free          5.0
                  Paid          1.0
Comics            Free          4.8
Communication     Paid          3.5
Education         Free          5.0
Entertainment     Free          5.0
Finance           Free          4.8

In [132]:
App_metadata_info.reset_index(inplace=True)

In [136]:
App_metadata_info['CategoryPrice']=App_metadata_info['Category']+'_'+ App_metadata_info['Price']
App_metadata_info.set_index('CategoryPrice',inplace=True)

In [137]:
App_metadata_info.head()

,Category,Price,Downloads_mean,Downloads_max,Rating_mean,Rating_max
CategoryPrice,,,,,,
Books & Reference_Free,Books & Reference,Free,33666.666667,50000,3.800000,4.3
Books & Reference_Paid,Books & Reference,Paid,10.000000,10,3.500000,3.5
Business_Free,Business,Free,5250.000000,10000,3.650000,4.3
Casual_Free,Casual,Free,18600.000000,50000,3.833333,5.0
Casual_Paid,Casual,Paid,6.100000,50,1.000000,1.0

up till now, we are using the agg function that pandas provide for us, some times, we may need to write our own agg functions.
for example,lets explore more about rating columns

In [139]:
App_data.Rating.isnull().sum()#44 ratings is null

44

In [140]:
App_data['Rating'].fillna(App_data['Rating'].mean(),inplace=True)

In [142]:
category_rating_info=App_data.groupby('Category')['Rating'].agg(['mean','std'])

In [146]:
category_rating_info.sort_values(by='std',ascending=False)
# pandas defaults to using the sample standard deviation, groups with only member is not able to use the std(),so there are nans in the result

                             mean       std
Category
Medical                  3.066667  1.789786
Finance                  3.760000  1.186592
Lifestyle                3.887912  0.929983
Casual                   3.702404  0.872828
Tools                    3.859341  0.813511
Maps & Navigation        3.875000  0.754431
Photography              3.863736  0.704924
Business                 3.650000  0.695222
Entertainment            3.570000  0.649872
Personalization          4.243077  0.647818
Education                4.037500  0.641288
Game                     3.715954  0.613499
Books & Reference        3.725000  0.590903
Health & Fitness         4.133333  0.535413
Travel & Local           3.728846  0.514154
Music & Audio            3.700000  0.424264
Productivity             4.000000  0.295804
Shopping                 3.957692  0.059832
Comics                   4.800000       NaN
Communication            3.500000       NaN
Libraries & Demo         4.200000       NaN
News & Magazines         3.400000       NaN
Social                   4.400000       NaN
Video Players & Editors  2.500000       NaN

In [147]:
def max_deviation(s):
    #note s is a series
    std_score = (s-s.mean())/s.std()
    return std_score.abs().max()

In [148]:
App_data.groupby('Category')['Rating'].agg(max_deviation)
#the Rating column as a series is passed to the max_deviation func

Category
Books & Reference          1.226935
Business                   0.934953
Casual                     3.096148
Comics                          NaN
Communication                   NaN
Education                  1.500886
Entertainment              2.200434
Finance                    1.314690
Game                       2.092987
Health & Fitness           1.618689
Libraries & Demo                NaN
Lifestyle                  1.814992
Maps & Navigation          1.491189
Medical                    1.154701
Music & Audio              0.707107
News & Magazines                NaN
Personalization            5.006154
Photography                1.611896
Productivity               2.366432
Shopping                   0.707107
Social                          NaN
Tools                      3.514816
Travel & Local             1.417565
Video Players & Editors         NaN
Name: Rating, dtype: float64

now lets make things more interesting:
suppose now we want to find the percentage of apps by category and price which have downloads between a certain range

In [155]:
def pct_between(s,low,high):
    #series s and two other parameters are being passed to this func
    return s.between(low,high).mean()

In [156]:
App_data.groupby(['Category','Price'])['Downloads'].agg(pct_between,10000,1000000)

Category                 Price
Books & Reference        Free     0.666667
                         Paid     0.000000
Business                 Free     0.250000
Casual                   Free     0.500000
                         Paid     0.000000
Comics                   Free     0.000000
Communication            Paid     0.000000
Education                Free     0.375000
Entertainment            Free     0.500000
Finance                  Free     0.500000
                         Paid     0.000000
Game                     Free     0.333333
                         Paid     0.000000
Health & Fitness         Free     0.500000
                         Paid     0.000000
Libraries & Demo         Free     0.000000
Lifestyle                Free     0.166667
                         Paid     0.000000
Maps & Navigation        Free     0.500000
Medical                  Free     0.000000
                         Paid     0.000000
Music & Audio            Free     1.000000
News & Magazines         Free     1.000000
Personalization          Free     1.000000
                         Paid     0.000000
Photography              Paid     0.000000
Productivity             Free     0.285714
                         Paid     0.500000
Shopping                 Free     0.000000
Social                   Free     1.000000
Tools                    Free     0.473684
                         Paid     0.000000
Travel & Local           Free     0.000000
Video Players & Editors  Free     0.000000
Name: Downloads, dtype: float64